IRP/src/InformationRegisters/LockDataModificationRules/LockDataModificationRules.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>LockDataModificationRules</name>
  <resources>
    <name>Attribute</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ComparisonType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Value</name>
    <type>
      <types>Number</types>
      <types>String</types>
      <types>Date</types>
      <types>Boolean</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/Enums/MetadataTypes/MetadataTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>MetadataTypes</name>
 <enumValues>
  <name>AccountingRegister</name>
 </enumValues>
 <enumValues>
  <name>AccumulationRegister</name>
 </enumValues>
 <enumValues>
  <name>BusinessProcess</name>
 </enumValues>
 <enumValues>
  <name>CalculationRegister</name>
 </enumValues>
 <enumValues>
  <name>Catalog</name>
 </enumValues>
 <enumValues>
  <name>ChartOfAccounts</name>
 </enumValues>
 <enumValues>
  <name>ChartOfCalculationTypes</name>
 </enumValues>
 <enumValues>
  <name>ChartOfCharacteristicTypes</name>
 </enumValues>
 <enumValues>
  <name>CommonAttribute</name>
 </enumValues>
 <enumValues>
  <name>CommonCommand</name>
 </enumValues>
 <enumValues>
  <name>CommonForm</name>
 </enumValues>
 <enumValues>
  <name>Configuration</name>
 </enumValues>
 <enumValues>
  <name>Constant</name>
 </enumValues>
 <enumValues>
  <name>DataProcessor</name>
 </enumValues>
 <enumValues>
  <name>Document</name>
 </enumValues>
 <enumValues>
  <name>DocumentJournal</name>
 </enumValues>
 <enumValues>
  <name>Enum</name>
 </enumValues>
 <enumValues>
  <name>ExchangePlan</name>
 </enumValues>
 <enumValues>
  <name>ExternalDataSource</name>
 </enumValues>
 <enumValues>
  <name>FilterCriterion</name>
 </enumValues>
 <enumValues>
  <name>HTTPService</name>
 </enumValues>
 <enumValues>
  <name>InformationRegister</name>
 </enumValues>
 <enumValues>
  <name>IntegrationService</name>
 </enumValues>
 <enumValues>
  <name>Report</name>
 </enumValues>
 <enumValues>
  <name>Role</name>
 </enumValues>
 <enumValues>
  <name>Sequence</name>
 </enumValues>
 <enumValues>
  <name>SessionParameter</name>
 </enumValues>
 <enumValues>
  <name>Subsystem</name>
 </enumValues>
 <enumValues>
  <name>Task</name>
 </enumValues>
 <enumValues>
  <name>WebService</name>
 </enumValues>
 <enumValues>
  <name>Interface</name>
 </enumValues>
 <enumValues>
  <name>Language</name>
 </enumValues>
</mdclass:Enum>

IRP/src/InformationRegisters/LockDataModificationRules/Forms/RecordForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	For Each Cat In Metadata.Catalogs Do
		Items.Type.ChoiceList.Add(Cat.FullName(), Cat.Synonym, , PictureLib.Catalog);
	EndDo;
	For Each Doc In Metadata.Documents Do
		Items.Type.ChoiceList.Add(Doc.FullName(), Doc.Synonym, , PictureLib.Document);
	EndDo;
	For Each IR In Metadata.InformationRegisters Do
		Items.Type.ChoiceList.Add(IR.FullName(), IR.Synonym, , PictureLib.InformationRegister);
	EndDo;
	For Each AR In Metadata.AccumulationRegisters Do
		Items.Type.ChoiceList.Add(AR.FullName(), AR.Synonym, , PictureLib.AccumulationRegister);
	EndDo;
	ComparisonTypeArray = StrSplit("=,<>,<,<=,>,>=,IN,IN HIERARCHY,BETWEEN,IS NULL", ",");
	Items.ComparisonType.ChoiceList.LoadValues(ComparisonTypeArray);
	TypeOnChangeAtServer();
EndProcedure

&AtClient
Procedure TypeOnChange(Item)
	TypeOnChangeAtServer();
	AttributeOnChangeAtServer();
EndProcedure

&AtServer
Procedure TypeOnChangeAtServer()
	If IsBlankString(Record.Type) Then
		Record.Attribute = Undefined;
		Return;
	EndIf;
	MetadataType = Enums.MetadataTypes[StrSplit(Record.Type,".")[0]];
	MetaItem = Metadata.FindByFullName(Record.Type);
	If MetadataInfo.hasAttributes(MetadataType) Then
		AddChild(MetaItem, Items.Attribute.ChoiceList, "Attributes");
	EndIf;
	If MetadataInfo.hasDimensions(MetadataType) Then
		AddChild(MetaItem, Items.Attribute.ChoiceList, "Dimensions");
	EndIf;
	If MetadataInfo.hasStandardAttributes(MetadataType) Then
		AddChild(MetaItem, Items.Attribute.ChoiceList, "StandardAttributes");
	EndIf;	
	If MetadataInfo.hasRecalculations(MetadataType) Then
		AddChild(MetaItem, Items.Attribute.ChoiceList, "Recalculations");
	EndIf;
	If MetadataInfo.hasAccountingFlags(MetadataType) Then
		AddChild(MetaItem, Items.Attribute.ChoiceList, "AccountingFlags");
	EndIf;

	For Each CmAttribute In Metadata.CommonAttributes Do
		If CmAttribute.Content.Contains(Record.Type) Then
			Items.Attribute.ChoiceList.Add("CommonAttributes." + CmAttribute.Name, 
				?(IsBlankString(CmAttribute.Synonym), CmAttribute.Name, CmAttribute.Synonym), , PictureLib.Attribute);
		EndIf;
	EndDo;
EndProcedure

&AtServer
Procedure AddChild(MetaItem, AttributeChoiceList, DataType)

	If NOT MetaItem[DataType].Count() Then
		Return;
	EndIf;

	For Each AddChild In MetaItem[DataType] Do
		AttributeChoiceList.Add(DataType + "." + AddChild.Name, ?(IsBlankString(AddChild.Synonym), AddChild.Name, AddChild.Synonym));
	EndDo;
	
EndProcedure

&AtClient
Procedure AttributeOnChange(Item)
	AttributeOnChangeAtServer();
EndProcedure

&AtServer
Procedure AttributeOnChangeAtServer()
	If IsBlankString(Record.Attribute) Then
		Record.Value = Undefined;
		Return;
	EndIf;
	If StrSplit(Record.Attribute, ".")[0] = "CommonAttributes" Then
		Items.Value.TypeRestriction = Metadata.FindByFullName(Record.Attribute).Type;
	Else
		Items.Value.TypeRestriction = Metadata.FindByFullName(Record.Type)
				[StrSplit(Record.Attribute, ".")[0]][StrSplit(Record.Attribute, ".")[1]].Type;
	EndIf;
EndProcedure
